Revit 2024 API
BentFabricStraightWiresLocation Enumeration
 Bent Fabric straight wires location. The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum BentFabricStraightWiresLocation
Visual Basic
Public Enumeration BentFabricStraightWiresLocation
Visual C++
public enum class BentFabricStraightWiresLocation
Members
Member name | Description
Right |  Fabric straight wires are located on the right side of bent wires.
Left |  Fabric straight wires are located on the left side of bent wires.
See Also
Autodesk.Revit.DB.Structure Namespace